/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : ScreenState.cs
수정일 : 2026-07-29

# 설명
Screen 실행 수명의 표시 상태를 정의한다.
========================================================================= BLOCK_HEADER_END */

namespace inonego.Xeri.UI
{
    // ============================================================
    /// <summary>
    /// Screen 실행 상태.
    /// </summary>
    // ============================================================
    public enum ScreenState
    {
        Opening = 0,
        Active = 1,
        Covered = 2,
        Closing = 3,
        Closed = 4,
    }
}
