/* BLOCK_HEADER_BEGIN =======================================================================
파일명 : XeriWindowEventArgs.cs
수정일 : 2026-09-20

# 설명
Xeri 커스텀 윈도우 이벤트 인자.
========================================================================= BLOCK_HEADER_END */

using System;

using UnityEngine;

namespace inonego.Xeri.UI.Window
{
    // ============================================================
    /// <summary>
    /// Xeri 커스텀 윈도우 이벤트 인자.
    /// </summary>
    // ============================================================
    [Serializable]
    public class XeriWindowEventArgs : EventArgs
    {

    #region 필드

        // ------------------------------------------------------------
        /// <summary>
        /// 이벤트 대상 윈도우 ID.
        /// </summary>
        // ------------------------------------------------------------
        public string ID;

        // ------------------------------------------------------------
        /// <summary>
        /// 이벤트 대상 윈도우 handle.
        /// </summary>
        // ------------------------------------------------------------
        public XeriWindowHandle Handle;

        // ------------------------------------------------------------
        /// <summary>
        /// 이벤트 시점의 위치.
        /// </summary>
        // ------------------------------------------------------------
        public Vector2 Pos;

        // ------------------------------------------------------------
        /// <summary>
        /// 이벤트 시점의 크기.
        /// </summary>
        // ------------------------------------------------------------
        public Vector2 Size;

        // ------------------------------------------------------------
        /// <summary>
        /// 이벤트 시점의 상태.
        /// </summary>
        // ------------------------------------------------------------
        public XeriWindowState State;

    #endregion

    }
}
